Repository: mypaint/libmypaint
Catalog: po/*.po
Languages: ta, uk

source: Opacity
ta: ஒளிபுகாநிலை
uk: Непрозорість

source: 0 means brush is transparent, 1 fully visible (also known as alpha or opacity)
ta: 0 என்றால் தூரிகை வெளிப்படையானது, 1 முழுமையாக தெரியும் (ஆல்பா அல்லது ஒளிபுகாநிலை என்றும் அழைக்கப்படுகிறது)
uk: 0 означає прозорий пензель, 1 — повністю видимий (також називаються альфою та точкою непрозорості)

source: Opacity multiply
ta: ஒளிபுகா பெருக்கம்
uk: Коефіцієнт непрозорості

source: This gets multiplied with opaque. You should only change the pressure input of this setting. Use 'opaque' instead to make opacity depend on speed. This setting is responsible to stop painting when there is zero pressure. This is just a convention, the behaviour is identical to 'opaque'.
ta: இது ஒளிபுகாவுடன் பெருகும். இந்த அமைப்பின் அழுத்தம் உள்ளீட்டை மட்டுமே நீங்கள் மாற்ற வேண்டும். ஒளிபுகாநிலையை வேகத்தில் சார்ந்து இருக்க 'ஒளிபுகா' ஐப் பயன்படுத்தவும். சுழிய அழுத்தம் இருக்கும்போது ஓவியத்தை நிறுத்த இந்த அமைப்பு பொறுப்பு. இது ஒரு மாநாடு மட்டுமே, நடத்தை 'ஒளிபுகா' போன்றது.
uk: Це збільшує непрозорість. Слід тільки змінити силу натиску в параметрах. Використовуйте «непрозорий» замість залежності непрозорості від швидкості. Цей параметр відповідає за припинення малювання, коли тиск на нулі. Це лише умовність, поведінка тотожна до варіанту «непрозорий».

source: Opacity linearize
ta: ஒளிபுகா நேரியல்
uk: Лінеаризація непрозорості

source: Correct the nonlinearity introduced by blending multiple dabs on top of each other. This correction should get you a linear ("natural") pressure response when pressure is mapped to opaque_multiply, as it is usually done. 0.9 is good for standard strokes, set it smaller if your brush scatters a lot, or higher if you use dabs_per_second. 0.0 the opaque value above is for the individual dabs 1.0 the opaque value above is for the final brush stroke, assuming each pixel gets (dabs_per_radius*2) brushdabs on average during a stroke
ta: ஒருவருக்கொருவர் மேல் பல DAB களை கலப்பதன் மூலம் அறிமுகப்படுத்தப்பட்ட நேர்கோட்டுத்தன்மையை சரிசெய்யவும். இந்த திருத்தம் உங்களுக்கு ஒரு நேரியல் ("இயற்கை") அழுத்த பதிலைப் பெற வேண்டும், இது வழக்கமாக செய்யப்படுவதால், ஒளிபுகா_மால்டிபிளிக்கு அழுத்தம் பொருத்தப்படும்போது. நிலையான பக்கவாதம் 0.9 நல்லது, உங்கள் தூரிகை நிறைய சிதறடிக்கப்பட்டால் அதை சிறியதாக அமைக்கவும், அல்லது நீங்கள் dabs_per_second ஐப் பயன்படுத்தினால் அதிகமாக இருக்கும். 0.0 மேலே உள்ள ஒளிபுகா மதிப்பு தனிப்பட்ட DAB களுக்கு 1.0 மேலே உள்ள ஒளிபுகா மதிப்பு இறுதி தூரிகை பக்கவாதத்திற்கானது, ஒவ்வொரு பிக்சலும் பெறுகிறது (dabs_per_radius*2) ஒரு பக்கவாதத்தின் போது சராசரியாக பிரச்டப்கள்
uk: Виправляти нелінійність внаслідок злиття декількох мазків, нанесених один на одного. У результаті виправлення ви отримаєте лінійні («природні») мазки під час відображення за допомогою параметра «коефіцієнт непрозорості». Значення 0,9 пасує до стандартних штрихів, зменшіть його, якщо використовуєте пензель зі значним розбризкуванням фарби або збільште, якщо ви використовуєте параметр «мазків на секунду». Значення непрозорості 0,0 слід використовувати для отримання картинки з окремих мазків Значення непрозорості 1,0 дасть вам спільний штрих пензлем, програма припускатиме, що кожен піксель відповідає (мазків на радіус*2) мазкам пензля у середньому під час виконання штриха

source: Radius
ta: ஆரம்
uk: Радіус

source: Basic brush radius (logarithmic) 0.7 means 2 pixels 3.0 means 20 pixels
ta: அடிப்படை தூரிகை ஆரம் (மடக்கை) 0.7 என்றால் 2 படப்புள்ளிகள் 3.0 என்றால் 20 படப்புள்ளிகள்
uk: Базовий радіус пензля (логаритмічний) 0,7 означає 2 пікселі 3,0 означає 20 пікселів

source: Hardness
ta: கடினத்தன்மை
uk: Жорсткість

source: Hard brush-circle borders (setting to zero will draw nothing). To reach the maximum hardness, you need to disable Pixel feather.
ta: கடின தூரிகை-வட்ட எல்லைகள் (பூச்சியமாக அமைப்பது எதுவும் வரையப்படாது). அதிகபட்ச கடினத்தன்மையை அடைய, நீங்கள் படப்புள்ளி இறகுகளை முடக்க வேண்டும்.
uk: Жорсткі межі кругового пензля (якщо вказати нульове значення, нічого не малюватиметься). Для максимальної жорсткості необхідно вимкнути «Згладжування меж».

source: Softness
ta: மென்மையாகும்
uk: М'якість

source: Soften brush-circle from center to edge (setting to 1.0 will draw nothing).
ta: தூரிகை-வட்டத்தை மையத்திலிருந்து விளிம்பிற்கு மென்மையாக்கவும் (1.0 ஆக அமைப்பது எதுவும் வரையப்படாது).
uk: Пом'якшує коло мазка пензля від центру до краю (якщо вказати 1,0 нічого не малюватиметься).

source: Pixel feather
ta: படப்புள்ளி இறகு
uk: Згладжування меж

source: This setting decreases the hardness when necessary to prevent a pixel staircase effect (aliasing) by making the dab more blurred. 0.0 disable (for very strong erasers and pixel brushes) 1.0 blur one pixel (good value) 5.0 notable blur, thin strokes will disappear
ta: இந்த அமைப்பு ஒரு படப்புள்ளி படிக்கட்டு விளைவை (மாற்றுப்பெயர்) தடுக்க தேவைப்படும்போது கடினத்தன்மையை குறைக்கிறது. 0.0 முடக்கு (மிகவும் வலுவான அழிப்பான் மற்றும் படப்புள்ளி தூரிகைகளுக்கு) 1.0 ஒரு பிக்சலை மங்கச் செய்யுங்கள் (நல்ல மதிப்பு) 5.0 குறிப்பிடத்தக்க மங்கலானது, மெல்லிய பக்கவாதம் மறைந்துவிடும்
uk: Цей параметр зменшує твердість, коли необхідно запобігти появі ефекту сходів (згладжування) роблячи мазки змазанішими. 0.0 вимкнено (дуже тверді гумки та піксельні пензлі) 1.0 змазаний один піксель (хороше значення) 5.0 сильне розмиття, тонкі мазки зникають

source: Dabs per basic radius
ta: அடிப்படை ஆரம் ஒன்றுக்கு dabs
uk: Мазків на основний радіус

source: How many dabs to draw while the pointer moves a distance of one brush radius (more precise: the base value of the radius)
ta: சுட்டிக்காட்டி ஒரு தூரிகை ஆரம் தூரத்தை நகர்த்தும்போது எத்தனை DAB கள் வரைய வேண்டும் (இன்னும் துல்லியமானது: ஆரம் அடிப்படை மதிப்பு)
uk: Скільки мазків малювати, поки вказівник рухається на відстань одного радіуса пензля (точніше на основі значення радіуса)

source: Dabs per actual radius
ta: உண்மையான ஆரம் ஒன்றுக்கு dabs
uk: Мазків на поточний радіус

source: Same as above, but the radius actually drawn is used, which can change dynamically
ta: மேலே உள்ளதைப் போலவே, ஆனால் உண்மையில் வரையப்பட்ட ஆரம் பயன்படுத்தப்படுகிறது, இது மாறும் வகையில் மாறும்
uk: Те саме, що і попередній параметр, але буде використано значення радіуса пензля під час малювання, яке може змінюватися динамічно

source: Dabs per second
ta: நொடிக்கு dabs
uk: Мазків на секунду

source: Dabs to draw each second, no matter how far the pointer moves
ta: சுட்டிக்காட்டி எவ்வளவு தூரம் நகர்ந்தாலும், ஒவ்வொரு நொடியையும் வரைய டப்ச்
uk: Кількість мазків на секунду, незалежно від переміщення вказівника миші

source: GridMap Scale
ta: கிரிட்மேப் அளவுகோல்
uk: Масштаб сітки

source: Changes the overall scale that the GridMap brush input operates on. Logarithmic (same scale as brush radius). A scale of 0 will make the grid 256x256 pixels.
ta: கிரிட்மேப் தூரிகை உள்ளீடு செயல்படும் ஒட்டுமொத்த அளவை மாற்றுகிறது. மடக்கை (தூரிகை ஆரம் போன்ற அதே அளவு). 0 இன் அளவு கட்டத்தை 256x256 படப்புள்ளிகள் செய்யும்.
uk: Змінює загальний масштаб, до якого застосовуються вхідні величини пензля "Сітка". Логаритмічний (той же масштаб, що й у радіуса пензля). За нульового рівня масштабу розмір сітки складе 256x256 пікселів.

source: GridMap Scale X
ta: கிரிட்மேப் அளவுகோல் ஃச்
uk: Масштаб сітки X

source: Changes the scale that the GridMap brush input operates on - affects X axis only. The range is 0-5x. This allows you to stretch or compress the GridMap pattern.
ta: கிரிட்மேப் தூரிகை உள்ளீடு செயல்படும் அளவை மாற்றுகிறது - ஃச் அச்சை மட்டுமே பாதிக்கிறது. வரம்பு 0-5x. இது கிரிட்மேப் வடிவத்தை நீட்ட அல்லது சுருக்க உங்களை அனுமதிக்கிறது.
uk: Змінює масштаб, до якого застосовуються вхідні величини пензля "Сітка" — впливає лише на вісь X. Діапазон: 0-5x. Дозволяє розтягнути або стиснути текстуру сітки.

source: GridMap Scale Y
ta: கிரிட்மேப் அளவுகோல் ஒய்
uk: Масштаб сітки Y

source: Changes the scale that the GridMap brush input operates on - affects Y axis only. The range is 0-5x. This allows you to stretch or compress the GridMap pattern.
ta: கிரிட்மேப் தூரிகை உள்ளீடு செயல்படும் அளவை மாற்றுகிறது - ஒய் அச்சை மட்டுமே பாதிக்கிறது. வரம்பு 0-5x. இது கிரிட்மேப் வடிவத்தை நீட்ட அல்லது சுருக்க உங்களை அனுமதிக்கிறது.
uk: Змінює масштаб, до якого застосовуються вхідні величини пензля "Сітка" — впливає лише на вісь Y. Діапазон: 0-5x. Дозволяє розтягнути або стиснути текстуру сітки.

source: Radius by random
ta: சீரற்ற மூலம் ஆரம்
uk: Випадковий радіус

source: Alter the radius randomly each dab. You can also do this with the by_random input on the radius setting. If you do it here, there are two differences: 1) the opaque value will be corrected such that a big-radius dabs is more transparent 2) it will not change the actual radius seen by dabs_per_actual_radius
ta: ஆரம் தோராயமாக ஒவ்வொரு DAB ஐ மாற்றவும். ஆரம் அமைப்பில் பை_ராண்டம் உள்ளீட்டையும் நீங்கள் செய்யலாம். நீங்கள் அதை இங்கே செய்தால், இரண்டு வேறுபாடுகள் உள்ளன: 1) ஒரு பெரிய-ரேடியச் டாப்ச் மிகவும் வெளிப்படையானதாக இருக்கும் வகையில் ஒளிபுகா மதிப்பு சரி செய்யப்படும் 2) இது DABS_PER_ACTUAL_RADIUS ஆல் பார்த்த உண்மையான ஆரம் மாற்றாது
uk: Випадково змінювати радіус кожного мазка. Схожого результату можна досягти за допомогою параметра випадкових вхідних даних радіуса. Якщо ви скористаєтеся цим параметром, розбіжності будуть такими: 1) значення непрозорості коригуватиметься так, що мазки з більшими радіусом будуть прозорішими 2) радіус малювання, що використовуватиметься для параметра «мазків на поточний радіус», не змінюватиметься

source: Fine speed filter
ta: சிறந்த வேக வடிகட்டி
uk: Фільтр точної швидкості

source: How slow the input fine speed is following the real speed 0.0 change immediately as your speed changes (not recommended, but try it)
ta: உள்ளீட்டு சிறந்த விரைவு எவ்வளவு மெதுவாக உண்மையான வேகத்தை பின்பற்றுகிறது 0.0 உங்கள் விரைவு மாறும்போது உடனடியாக மாற்றவும் (பரிந்துரைக்கப்படவில்லை, ஆனால் அதை முயற்சிக்கவும்)
uk: Визначає, наскільки повільно встановлюватиметься відповідність між вхідними даними швидкості та справжньою швидкістю 0,0 відповідатиме негайному встановленню відповідності (не рекомендовано, але ви можете спробувати)

source: Gross speed filter
ta: மொத்த வேக வடிகட்டி
uk: Фільтр основної швидкості

source: Same as 'fine speed filter', but note that the range is different
ta: 'சிறந்த வேக வடிகட்டி' போலவே, ஆனால் வரம்பு வேறுபட்டது என்பதை நினைவில் கொள்க
uk: Те ж, що і «фільтр точної швидкості», але з іншим діапазоном

source: Fine speed gamma
ta: சிறந்த விரைவு காமா
uk: Гама точної швидкості

source: This changes the reaction of the 'fine speed' input to extreme physical speed. You will see the difference best if 'fine speed' is mapped to the radius. -8.0 very fast speed does not increase 'fine speed' much more +8.0 very fast speed increases 'fine speed' a lot For very slow speed the opposite happens.
ta: இது 'சிறந்த விரைவு' உள்ளீட்டின் எதிர்வினையை தீவிர உடல் வேகத்திற்கு மாற்றுகிறது. 'சிறந்த விரைவு' ஆரம் கொண்டு வரைபடமாக இருந்தால் வித்தியாசத்தை நீங்கள் காண்பீர்கள். -8.0 மிக விரைவான விரைவு 'சிறந்த வேகத்தை' அதிகரிக்காது +8.0 மிக விரைவான விரைவு 'சிறந்த வேகத்தை' நிறைய அதிகரிக்கிறது மிக மெதுவான வேகத்திற்கு இதற்கு நேர்மாறானது நிகழ்கிறது.
uk: Змінює реакцію введення «точної швидкості» на дуже велику фізичну швидкість. Вплив цього параметра найпомітніший, якщо точну швидкість пов'язано з радіусом. -8,0 — значне пришвидшення не призводить до значного підвищення точної швидкості +8,0 — значне пришвидшення призводить до значного підвищення точної швидкості Повільний рух вказівника, відповідно, призводитиме до зворотніх ефектів.

source: Gross speed gamma
ta: மொத்த விரைவு காமா
uk: Гама основної швидкості

source: Same as 'fine speed gamma' for gross speed
ta: மொத்த வேகத்திற்கு 'ஃபைன் ச்பீட் காமா' போன்றது
uk: Те саме, що і «гама точної швидкості», але для основної швидкості

source: Jitter
ta: நடுக்கம்
uk: Тремтіння

source: Add a random offset to the position where each dab is drawn 0.0 disabled 1.0 standard deviation is one basic radius away <0.0 negative values produce no jitter
ta: ஒவ்வொரு DAB ஐ வரையும் நிலைக்கு ஒரு சீரற்ற ஆஃப்செட்டைச் சேர்க்கவும் 0.0 முடக்கப்பட்டது 1.0 நிலையான விலகல் என்பது ஒரு அடிப்படை ஆரம் தொலைவில் உள்ளது <0.0 எதிர்மறை மதிப்புகள் எந்த நடுக்கத்தையும் உருவாக்கவில்லை
uk: Додає випадкове зміщення до позиції мазка 0,0 — вимкнено 1,0 — стандартне відхилення в один базовий радіус <0,0 — від’ємні значення вимикають тремтіння

source: Offset Y
ta: ஆஃப்செட் ஒய்
uk: Зміщення Y

source: Moves the dabs up or down based on canvas coordinates.
ta: கேன்வாச் ஆயத்தொகுதிகளின் அடிப்படையில் DAB களை மேலே அல்லது கீழ் நகர்த்துகிறது.
uk: Переміщує мазки вгору або вниз на основі координат полотна.

source: Offset X
ta: ஆஃப்செட் ஃச்
uk: Зміщення X

source: Moves the dabs left or right based on canvas coordinates.
ta: கேன்வாச் ஆயத்தொலைவுகளின் அடிப்படையில் DAB களை இடது அல்லது வலது நகர்த்துகிறது.
uk: Переміщує мазки вліво або вправо на основі координат полотна.

source: Angular Offset: Direction
ta: கோண ஆஃப்செட்: திசை
uk: Кутове зміщення: напрямок

source: Follows the stroke direction to offset the dabs to one side.
ta: DAB களை ஒரு பக்கத்திற்கு ஈடுசெய்ய பக்கவாதம் திசையைப் பின்பற்றுகிறது.
uk: Дотримується напрямку штрихів для зміщення мазків в один бік.

source: Angular Offset: Ascension
ta: கோண ஆஃப்செட்: அசென்சன்
uk: Кутове зміщення: підйом

source: Follows the tilt direction to offset the dabs to one side. Requires Tilt.
ta: DAB களை ஒரு பக்கத்திற்கு ஈடுசெய்ய சாய்ந்த திசையைப் பின்பற்றுகிறது. சாய்வு தேவை.
uk: Зміщує мазки в один бік, слідуючи за напрямком нахилу. Потрібно ввімкнути параметр «Нахил».

source: Angular Offset: View
ta: கோண ஆஃப்செட்: பார்வை
uk: Кутове зміщення: показ

source: Follows the view orientation to offset the dabs to one side.
ta: DAB களை ஒரு பக்கத்திற்கு ஈடுசெய்ய பார்வை நோக்குநிலையைப் பின்பற்றுகிறது.
uk: Зміщує мазки в один бік, слідуючи за орієнтацією показу.

source: Angular Offset Mirrored: Direction
ta: கோண ஆஃப்செட் பிரதிபலித்தது: திசை
uk: Відбите кутове зміщення: напрямок

source: Follows the stroke direction to offset the dabs, but to both sides of the stroke.
ta: DAB களை ஈடுசெய்ய பக்கவாதம் திசையைப் பின்பற்றுகிறது, ஆனால் பக்கவாதத்தின் இருபுறமும்.
uk: Зміщує мазки обабіч штриха, слідуючи за напрямком штриха.

source: Angular Offset Mirrored: Ascension
ta: கோண ஆஃப்செட் பிரதிபலித்தது: அசென்சன்
uk: Відбите кутове зміщення: підйом

source: Follows the tilt direction to offset the dabs, but to both sides of the stroke. Requires Tilt.
ta: DAB களை ஈடுசெய்ய சாய்ந்த திசையைப் பின்பற்றுகிறது, ஆனால் பக்கவாதத்தின் இருபுறமும். சாய்வு தேவை.
uk: Зміщує мазки обабіч штриха, слідуючи за напрямком нахилу. Потрібно увімкнути параметр «Нахил».

source: Angular Offset Mirrored: View
ta: கோண ஆஃப்செட் பிரதிபலித்தது: பார்வை
uk: Відбите кутове зміщення: показ

source: Follows the view orientation to offset the dabs, but to both sides of the stroke.
ta: DAB களை ஈடுசெய்ய பார்வை நோக்குநிலையைப் பின்பற்றுகிறது, ஆனால் பக்கவாதத்தின் இருபுறமும்.
uk: Зміщує мазки обабіч штриха, слідуючи за орієнтацією показу.

source: Angular Offsets Adjustment
ta: கோண ஆஃப்செட்டுகள் சரிசெய்தல்
uk: Коригування кутових зміщень

source: Change the Angular Offset angle from the default, which is 90 degrees.
ta: இயல்புநிலையிலிருந்து கோண ஆஃப்செட் கோணத்தை மாற்றவும், இது 90 டிகிரி ஆகும்.
uk: Змінити значення кута для кутового зміщення (усталено він складає 90 градусів).

source: Offsets Multiplier
ta: ஆஃப்செட்டுகள் பெருக்கி
uk: Коефіцієнт зміщень

source: Logarithmic multiplier for X, Y, and Angular Offset settings.
ta: ஃச், ஒய் மற்றும் கோண ஆஃப்செட் அமைப்புகளுக்கான மடக்கை பெருக்கி.
uk: Логаритмічний коефіцієнт для налаштувань зміщень X, Y і кутових зміщень.

source: Offset by speed
ta: வேகத்தால் ஈடுசெய்யவும்
uk: Зміщення за швидкістю

source: Change position depending on pointer speed = 0 disable > 0 draw where the pointer moves to < 0 draw where the pointer comes from
ta: சுட்டிக்காட்டி வேகத்தைப் பொறுத்து நிலையை மாற்றவும் = 0 முடக்கு > 0 சுட்டிக்காட்டி நகரும் இடத்தை வரையவும் <0 சுட்டிக்காட்டி எங்கிருந்து வருகிறது என்பதை வரையவும்
uk: Зміна позиції залежно від швидкості вказівника = 0 вимкнено > 0 малювати у напрямку руху вказівника < 0 малювати в протилежному напрямку

source: Offset by speed filter
ta: வேக வடிகட்டி மூலம் ஈடுசெய்யவும்
uk: Фільтр зміщення за швидкістю

source: How slow the offset goes back to zero when the cursor stops moving
ta: கர்சர் நகர்வதை நிறுத்தும்போது ஆஃப்செட் எவ்வளவு மெதுவாக பூச்சியத்திற்கு செல்கிறது
uk: Визначає швидкість повернення зміщення до нульового значення після зупинки вказівника

source: Slow position tracking
ta: மெதுவான நிலை கண்காணிப்பு
uk: Повільне відстеження вказівника

source: Slowdown pointer tracking speed. 0 disables it, higher values remove more jitter in cursor movements. Useful for drawing smooth, comic-like outlines.
ta: மெதுவான சுட்டிக்காட்டி கண்காணிப்பு விரைவு. 0 அதை முடக்குகிறது, அதிக மதிப்புகள் கர்சர் இயக்கங்களில் அதிக நடுக்கத்தை நீக்குகின்றன. மென்மையான, காமிக் போன்ற வெளிப்புறங்களை வரைவதற்கு பயனுள்ளதாக இருக்கும்.
uk: Сповільнення відстеження швидкості вказівника. Нульове значення вимикає сповільнення, вищі значення усуватимуть тремтіння під час руху вказівника. Корисно для малювання плавних контурів.

source: Slow tracking per dab
ta: ஒரு DAB க்கு மெதுவாக கண்காணித்தல்
uk: Сповільнення відстеження за мазками

source: Similar as above but at brushdab level (ignoring how much time has passed if brushdabs do not depend on time)
ta: மேலே உள்ளதைப் போன்றது ஆனால் பிரச்டாப் மட்டத்தில் (பிரச்டப்கள் நேரத்தை சார்ந்து இல்லாவிட்டால் எவ்வளவு நேரம் கடந்துவிட்டது என்பதை புறக்கணித்தல்)
uk: Параметр, подібний до попереднього, але працює на рівні мазків пензлем (час не береться до уваги, якщо визначення мазків відбувається без урахування часових параметрів)

source: Tracking noise
ta: ஒலி கண்காணிக்கும்
uk: Шум відстеження

source: Add randomness to the mouse pointer; this usually generates many small lines in random directions; maybe try this together with 'slow tracking'
ta: சுட்டி சுட்டிக்காட்டி சீரற்ற தன்மையைச் சேர்க்கவும்; இது வழக்கமாக பல சிறிய கோடுகளை சீரற்ற திசைகளில் உருவாக்குகிறது; 'மெதுவான கண்காணிப்பு' உடன் இதை முயற்சிக்கவும்
uk: Додає випадкові відхилення до маршруту вказівника; таким чином, зазвичай, буде створено багато маленьких ліній у випадкових напрямках; можете спробувати цей пункт разом з «повільним відстеженням»

source: Color hue
ta: வண்ண சாயல்
uk: Відтінок кольору

source: Color saturation
ta: வண்ண செறிவு
uk: Насиченість кольору

source: Color value
ta: வண்ண மதிப்பு
uk: Значення кольору

source: Color value (brightness, intensity)
ta: வண்ண மதிப்பு (பிரகாசம், தீவிரம்)
uk: Значення кольору (яскравість, інтенсивність)

source: Save color
ta: நிறத்தை சேமிக்கவும்
uk: Зберегти колір

source: When selecting a brush, the color can be restored to the color that the brush was saved with. 0.0 do not modify the active color when selecting this brush 0.5 change active color towards brush color 1.0 set the active color to the brush color when selected
ta: ஒரு தூரிகையைத் தேர்ந்தெடுக்கும்போது, தூரிகை சேமிக்கப்பட்ட வண்ணத்திற்கு வண்ணத்தை மீட்டெடுக்க முடியும். இந்த தூரிகையைத் தேர்ந்தெடுக்கும்போது 0.0 செயலில் உள்ள வண்ணத்தை மாற்ற வேண்டாம் 0.5 தூரிகை நிறத்தை நோக்கி செயலில் உள்ள வண்ணத்தை மாற்றவும் 1.0 தேர்ந்தெடுக்கப்பட்டால் செயலில் உள்ள வண்ணத்தை தூரிகை நிறத்திற்கு அமைக்கவும்
uk: При виборі пензля колір може бути змінений на такий, з яким пензель був збережений 0.0 не змінювати колір під час вибору пензля 0.5 змінити колір ближче до кольору пензля 1.0 встановити колір вибраного пензля

source: Change color hue
ta: வண்ண சாயலை மாற்றவும்
uk: Змінити відтінок кольору

source: Change color hue. -0.1 small clockwise color hue shift 0.0 disable 0.5 counterclockwise hue shift by 180 degrees
ta: வண்ண சாயலை மாற்றவும். -0.1 சிறிய கடிகார திசையில் வண்ண சாயல் மாற்றம் 0.0 முடக்கு 0.5 எதிரெதிர் சாயல் சாயல் 180 டிகிரி
uk: Зміна відтінку кольору. -0,1 незначне зміщення відтінку за годинниковою стрілкою 0,0 вимкнено 0,5 зміщення відтінку на 180 градусів проти годинникової стрілки

source: Change color lightness (HSL)
ta: வண்ண லேசான தன்மையை மாற்றவும் (HSL)
uk: Змінити світлість кольору (HSL)

source: Change the color lightness using the HSL color model. -1.0 blacker 0.0 disable 1.0 whiter
ta: HSL வண்ண மாதிரியைப் பயன்படுத்தி வண்ண லேசான தன்மையை மாற்றவும். -1.0 கருப்பு 0.0 முடக்கு 1.0 வைட்டர்
uk: Зміна освітленості кольору за допомогою моделі кольорів HSL. -1,0 —темніший 0,0 — вимкнено 1,0 — світліший

source: Change color satur. (HSL)
ta: கலர் சதுரத்தை மாற்றவும். (எச்.எச்.எல்)
uk: Змінити насиченість кольору. (HSL)

source: Change the color saturation using the HSL color model. -1.0 more grayish 0.0 disable 1.0 more saturated
ta: HSL வண்ண மாதிரியைப் பயன்படுத்தி வண்ண செறிவூட்டலை மாற்றவும். -1.0 மேலும் சாம்பல் நிறத்தில் 0.0 முடக்கு 1.0 மேலும் நிறைவுற்றது
uk: Зміна насиченості кольору за допомогою моделі кольорів HSL. -1,0 — сіріший 0,0 — вимкнено 1.0 — насиченіший

source: Change color value (HSV)
ta: வண்ண மதிப்பை மாற்றவும் (HSV)
uk: Змінити значення кольору (HSV)

source: Change the color value (brightness, intensity) using the HSV color model. HSV changes are applied before HSL. -1.0 darker 0.0 disable 1.0 brigher
ta: HSV வண்ண மாதிரியைப் பயன்படுத்தி வண்ண மதிப்பை (பிரகாசம், தீவிரம்) மாற்றவும். HSL க்கு முன் HSV மாற்றங்கள் பயன்படுத்தப்படுகின்றன. -1.0 இருண்டது 0.0 முடக்கு 1.0 பிரைட்டர்
uk: Зміна значення кольору (яскравості, інтенсивності) за допомогою моделі кольорів HSV. Зміни HSV застосовуватимуться перед змінами HSL. -1,0 — темніший 0,0 — вимкнено 1,0 — світліший

source: Change color satur. (HSV)
ta: கலர் சதுரத்தை மாற்றவும். (HSV)
uk: Змінити насиченість кольору. (HSV)

source: Change the color saturation using the HSV color model. HSV changes are applied before HSL. -1.0 more grayish 0.0 disable 1.0 more saturated
ta: HSV வண்ண மாதிரியைப் பயன்படுத்தி வண்ண செறிவூட்டலை மாற்றவும். HSL க்கு முன் HSV மாற்றங்கள் பயன்படுத்தப்படுகின்றன. -1.0 மேலும் சாம்பல் நிறத்தில் 0.0 முடக்கு 1.0 மேலும் நிறைவுற்றது
uk: Зміна насиченості кольору за використання моделі кольорів HSV. Зміни у HSV застосовуватимуться раніше змін у HSL. -1,0 — сіріший 0,0 — вимкнено 1.0 — насиченіший

source: Smudge
ta: ச்மட்ச்
uk: Розмазування

source: Paint with the smudge color instead of the brush color. The smudge color is slowly changed to the color you are painting on. 0.0 do not use the smudge color 0.5 mix the smudge color with the brush color 1.0 use only the smudge color
ta: தூரிகை நிறத்திற்கு பதிலாக ச்மட்ச் நிறத்துடன் வண்ணம் தீட்டவும். ச்மட்ச் நிறம் மெதுவாக நீங்கள் ஓவியம் வரைந்த வண்ணத்திற்கு மாற்றப்படுகிறது. 0.0 ச்மட்ச் நிறத்தைப் பயன்படுத்த வேண்டாம் 0.5 தூரிகை நிறத்துடன் ச்மட்ச் நிறத்தை கலக்கவும் 1.0 ச்மட்ச் நிறத்தை மட்டுமே பயன்படுத்துங்கள்
uk: Визначає параметри малювання змішаним кольором замість кольору пензля. За використання розмазування колір поступово зливатиметься з кольором ділянки малюнка, на якій відбувається малювання. 0,0 — не використовувати розмазування 0,5 — змішувати розмазаний колір з кольором пензля 1,0 — використовувати лише розмазаний колір

source: Pigment
ta: நிறமி
uk: Барвник

source: Subtractive spectral color mixing mode. 0.0 no spectral mixing 1.0 only spectral mixing
ta: கழித்தல் நிறமாலை வண்ண கலவை முறை. 0.0 ச்பெக்ட்ரல் கலவை இல்லை 1.0 ச்பெக்ட்ரல் கலவை மட்டுமே
uk: Віднімальний режим змішування спектральних кольорів. 0.0 - без змішування спектрів 1.0 - тільки змішування спектрів

source: Smudge transparency
ta: வெளிப்படைத்தன்மை
uk: Прозорість розмазування
