Repository: mypaint/libmypaint
Catalog: po/*.po
Languages: ta, uk

source: The base brush radius allows you to change the behavior of a brush as you make it bigger or smaller. You can even cancel out dab size increase and adjust something else to make a brush bigger. Take note of "Dabs per basic radius" and "Dabs per actual radius", which behave much differently.
ta: அடிப்படை தூரிகை ஆரம் ஒரு தூரிகையின் நடத்தையை பெரியதாகவோ அல்லது சிறியதாகவோ மாற்ற அனுமதிக்கிறது. நீங்கள் DAB அளவு அதிகரிப்பை ரத்துசெய்து, தூரிகையை பெரிதாக்க வேறு ஏதாவது ஒன்றை சரிசெய்யலாம். மிகவும் வித்தியாசமாக நடந்துகொள்ளும் "அடிப்படை ஆரம்" மற்றும் "உண்மையான ஆரம் ஒன்றுக்கு DABS" ஆகியவற்றைக் கவனியுங்கள்.
uk: Цей параметр дозволяє управляти поведінкою пензля, змінюючи його розмір. Можна навіть скасувати збільшення розміру мазків і налаштувати що-небудь ще, щоб збільшити пензель. Зверніть увагу на параметри "Мазків на основний радіус" і "Мазків на поточний радіус", вони працюють зовсім по-іншому.

source: Barrel Rotation
ta: பீப்பாய் சுழற்சி
uk: Обертання

source: Barrel rotation of stylus. 0 when not twisted +90 when twisted clockwise 90 degrees -90 when twisted counterclockwise 90 degrees
ta: ச்டைலசின் பீப்பாய் சுழற்சி. 0 முறுக்காதபோது +90 கடிகார திசையில் 90 டிகிரி -90 எதிரெதிர் திசையில் 90 டிகிரி முறுக்கும்போது
uk: Обертання стилуса. 0 - не обертається +90 - обертання на 90 градусів за годинниковою стрілкою -90 - обертання на 90 градусів проти годинникової стрілки
