Repository: mypaint/libmypaint
Catalog: po/*.po
Languages: ta, uk

source: Control how much transparency is picked up and smudged, similar to lock alpha. 1.0 will not move any transparency. 0.5 will move only 50% transparency and above. 0.0 will have no effect. Negative values do the reverse
ta: பூட்டு ஆல்பாவைப் போலவே எவ்வளவு வெளிப்படைத்தன்மை எடுக்கப்பட்டு மங்கலானது என்பதைக் கட்டுப்படுத்தவும். 1.0 எந்த வெளிப்படைத்தன்மையையும் நகர்த்தாது. 0.5 50% வெளிப்படைத்தன்மை மற்றும் அதற்கு மேல் மட்டுமே நகரும். 0.0 எந்த விளைவையும் ஏற்படுத்தாது. எதிர்மறை மதிப்புகள் தலைகீழ் செய்கின்றன
uk: Керування тим, за якого значення прозорість буде розмазано, аналогічно блокуванню альфа-каналу. 1.0 - прозорість не розмазується. 0.5 - розмазування виконується лише за значення прозорості 50% і вище. 0.0 - ефекту немає. Від'ємні значення мають зворотний ефект

source: Smudge length
ta: ச்மட்ச் நீளம்
uk: Довжина розмазування

source: This controls how fast the smudge color becomes the color you are painting on. 0.0 immediately update the smudge color (requires more CPU cycles because of the frequent color checks) 0.5 change the smudge color steadily towards the canvas color 1.0 never change the smudge color
ta: நீங்கள் வரைவதற்கு ச்மட்ச் நிறம் எவ்வளவு விரைவாக மாறுகிறது என்பதை இது கட்டுப்படுத்துகிறது. 0.0 உடனடியாக ச்மட்ச் வண்ணத்தை புதுப்பிக்கவும் (அடிக்கடி வண்ண சோதனைகள் காரணமாக அதிக சிபியு சுழற்சிகள் தேவை) 0.5 கேன்வாச் நிறத்தை நோக்கி மங்கலான நிறத்தை சீராக மாற்றவும் 1.0 ஒருபோதும் ச்மட்ச் நிறத்தை மாற்ற வேண்டாம்
uk: Визначає швидкість злиття кольору розмазування з кольором ділянки полотна, на якій ви малюєте. 0.0 — негайна зміна кольору розмазування (більше навантаження на ЦП) 0.5 — зміна кольору розмазування неухильно до кольору полотна 1.0 — без зміни кольору розмазування

source: Smudge length multiplier
ta: ச்மட்ச் நீளம் பெருக்கி
uk: Коефіцієнт довжини розмазування

source: Logarithmic multiplier for the "Smudge length" value. Useful to correct for high-definition/large brushes with lots of dabs. The longer the smudge length the more a color will spread and will also boost performance dramatically, as the canvas is sampled less often
ta: "ச்மட்ச் நீளம்" மதிப்புக்கான மடக்கை பெருக்கி. நிறைய DAB களுடன் உயர் வரையறை/பெரிய தூரிகைகளுக்கு சரிசெய்ய பயனுள்ளதாக இருக்கும். கேன்வாச் குறைவாக அடிக்கடி மாதிரியாக இருப்பதால், ஒரு வண்ணம் அதிக அளவில் பரவுகிறது, மேலும் செயல்திறனை வியத்தகு முறையில் அதிகரிக்கும்
uk: Логаритмічний коефіцієнт для значення «Довжини розмазування». Корисно для корекції пензлів з високою роздільністю або великих пензлів з великою кількістю мазків. Чим більше значення довжини розмазування, тим сильніше буде розмазано колір, а також значно зросте швидкодія, оскільки аналіз полотна виконуватиметься рідше

source: Smudge bucket
ta: ச்மட்ச் பக்கெட்
uk: Сегмент розмазування

source: There are 256 buckets that each can hold a color picked up from the canvas. You can control which bucket to use to improve variability and realism of the brush. Especially useful with the "Custom input" setting to correlate buckets with other settings such as offsets.
ta: ஒவ்வொன்றும் கேன்வாசிலிருந்து எடுக்கப்பட்ட வண்ணத்தை வைத்திருக்கக்கூடிய 256 வாளிகள் உள்ளன. தூரிகையின் மாறுபாடு மற்றும் யதார்த்தத்தை மேம்படுத்த எந்த வாளியைப் பயன்படுத்த வேண்டும் என்பதை நீங்கள் கட்டுப்படுத்தலாம். ஆஃப்செட்டுகள் போன்ற பிற அமைப்புகளுடன் வாளிகளை தொடர்புபடுத்த "தனிப்பயன் உள்ளீடு" அமைப்பில் குறிப்பாக பயனுள்ளதாக இருக்கும்.
uk: Є 256 сегментів, кожен з яких може містити отриманий з полотна колір. Можна керувати вибором сегмента, який буде використовуватися, для поліпшення варіативності та підвищення реалістичності пензля. Це особливо корисно в поєднанні з параметром «Користувацьке введення», що дає змогу пов'язувати сегменти з іншими параметрами, наприклад, зі зміщеннями.

source: Smudge radius
ta: ச்மட்ச் ஆரம்
uk: Радіус розмазування

source: This modifies the radius of the circle where color is picked up for smudging. 0.0 use the brush radius -0.7 half the brush radius (fast, but not always intuitive) +0.7 twice the brush radius +1.6 five times the brush radius (slow performance)
ta: இது வட்டத்தின் ஆரம் மாற்றியமைக்கிறது, அங்கு வண்ணமயமாக்கப்படுவதற்கு வண்ணம் எடுக்கப்படுகிறது. 0.0 தூரிகை ஆரம் பயன்படுத்தவும் -0.7 பாதி தூரிகை ஆரம் (வேகமாக, ஆனால் எப்போதும் உள்ளுணர்வு இல்லை) +0.7 தூரிகை ஆரம் இரு மடங்கு +1.6 தூரிகை ஆரம் (மெதுவான செயல்திறன்)
uk: Змінює радіус кола, звідки береться колір для розмазування. 0.0 використовується радіус пензля -0.7 використовується половина радіуса пензля (швидше, але не завжди інтуїтивно) +0.7 вдвічі більший за радіус пензля +1.6 у п’ять разів більше ніж радіус пензля (повільніша робота)

source: Eraser
ta: அழிப்பான்
uk: Гумка

source: how much this tool behaves like an eraser 0.0 normal painting 1.0 standard eraser 0.5 pixels go towards 50% transparency
ta: இந்த கருவி அழிப்பான் போல எவ்வளவு செயல்படுகிறது 0.0 சாதாரண ஓவியம் 1.0 நிலையான அழிப்பான் 0.5 படப்புள்ளிகள் 50% வெளிப்படைத்தன்மையை நோக்கி செல்கின்றன
uk: Визначає подібність поведінки цього інструменту до справжньої гумки 0.0 — звичайне малювання 1.0 — стандартна гумка 0.5 — малювання пікселями з 50% прозорості

source: Stroke threshold
ta: பக்கவாதம் வாசல்
uk: Поріг штриха

source: How much pressure is needed to start a stroke. This affects the stroke input only. MyPaint does not need a minimum pressure to start drawing.
ta: பக்கவாதத்தைத் தொடங்க எவ்வளவு அழுத்தம் தேவை. இது பக்கவாதம் உள்ளீட்டை மட்டுமே பாதிக்கிறது. வரைபடத்தைத் தொடங்க MyPaint க்கு குறைந்தபட்ச அழுத்தம் தேவையில்லை.
uk: Визначає порогове значення натиску, потрібне для малювання штриха. Параметр впливає лише на вхідні дані штриха. MyPaint не використовує даних щодо мінімального натиску для визначення малювання.

source: Stroke duration
ta: பக்கவாதம் காலம்
uk: Тривалість штриха

source: How far you have to move until the stroke input reaches 1.0. This value is logarithmic (negative values will not invert the process).
ta: பக்கவாதம் உள்ளீடு 1.0 ஐ அடையும் வரை நீங்கள் எவ்வளவு தூரம் செல்ல வேண்டும். இந்த மதிப்பு மடக்கை (எதிர்மறை மதிப்புகள் செயல்முறையை மாற்றாது).
uk: Визначає на відстань яку слід посунути вказівник, щоб інтенсивність штриха досягла 1,0. Значення у логаритмічній шкалі (від'ємні значення не даватимуть від'ємних відстаней).

source: Stroke hold time
ta: பக்கவாதம் நேரம்
uk: Час утримування штриха

source: This defines how long the stroke input stays at 1.0. After that it will reset to 0.0 and start growing again, even if the stroke is not yet finished. 2.0 means twice as long as it takes to go from 0.0 to 1.0 9.9 or higher stands for infinite
ta: பக்கவாதம் உள்ளீடு எவ்வளவு காலம் 1.0 ஆக இருக்கும் என்பதை இது வரையறுக்கிறது. அதன்பிறகு அது 0.0 க்கு மீட்டமைக்கப்பட்டு, பக்கவாதம் இன்னும் முடிக்கப்படாவிட்டாலும் மீண்டும் வளரத் தொடங்கும். 2.0 என்றால் 0.0 முதல் 1.0 வரை செல்ல இரண்டு மடங்கு நீளமானது 9.9 அல்லது அதற்கு மேற்பட்டவை எல்லையற்றவை
uk: Визначає тривалість періоду, протягом якого значення вхідних даних штриха залишатиметься рівним 1,0. Після завершення цього періоду, інтенсивність знову буде скинуто до нульового значення (малювання розпочнеться з початку), навіть якщо малювання штриха ще не завершено. Значення 2,0 означає подвійну тривалість переходу від 0,0 до 1,0 9,9 та більші значення відповідають нескінченності

source: Custom input
ta: தனிப்பயன் உள்ளீடு
uk: Нетипові вхідні дані

source: Set the custom input to this value. If it is slowed down, move it towards this value (see below). The idea is that you make this input depend on a mixture of pressure/speed/whatever, and then make other settings depend on this 'custom input' instead of repeating this combination everywhere you need it. If you make it change 'by random' you can generate a slow (smooth) random input.
ta: தனிப்பயன் உள்ளீட்டை இந்த மதிப்புக்கு அமைக்கவும். அது மெதுவாக இருந்தால், அதை இந்த மதிப்பை நோக்கி நகர்த்தவும் (கீழே காண்க). இந்த உள்ளீட்டை நீங்கள் அழுத்தம்/வேகம்/எதுவாக இருந்தாலும் சார்ந்து இந்த உள்ளீட்டைச் சார்ந்து, பின்னர் இந்த கலவையை உங்களுக்குத் தேவையான எல்லா இடங்களிலும் மீண்டும் செய்வதற்குப் பதிலாக இந்த 'தனிப்பயன் உள்ளீட்டை' சார்ந்துள்ளது. நீங்கள் அதை 'சீரற்ற' மூலம் மாற்றினால், மெதுவான (மென்மையான) சீரற்ற உள்ளீட்டை உருவாக்கலாம்.
uk: Встановлює вказане значення нетипових вхідних даних. Сповільнення призводитиме до повернення до вказаного значення (див. нижче). Таким чином, ви можете встановити залежність вхідних даних від комплексу натиск/швидкість/інші параметри, а потім встановити залежність цього комплексу від «нетипових вхідних даних», замість заміни параметрів на цей комплекс у потрібних місцях. Якщо ви оберете випадкову зміну, ви зможете отримати повільнішу (плавнішу) випадкову зміну вхідних даних.

source: Custom input filter
ta: தனிப்பயன் உள்ளீட்டு வடிகட்டி
uk: Фільтр нетипових вхідних даних

source: How slow the custom input actually follows the desired value (the one above). This happens at brushdab level (ignoring how much time has passed, if brushdabs do not depend on time). 0.0 no slowdown (changes apply instantly)
ta: தனிப்பயன் உள்ளீடு உண்மையில் எவ்வளவு மெதுவாக விரும்பிய மதிப்பைப் பின்பற்றுகிறது (மேலே உள்ள ஒன்று). இது பிரச்டாப் மட்டத்தில் நிகழ்கிறது (பிரச்டப்கள் நேரத்தை சார்ந்து இல்லாவிட்டால், எவ்வளவு நேரம் கடந்துவிட்டது என்பதை புறக்கணித்தல்). 0.0 மந்தநிலை இல்லை (மாற்றங்கள் உடனடியாக பொருந்தும்)
uk: Визначає швидкість набуття нетиповими вхідними значеннями бажаного значення (визначеного вище). Зміна відбуватиметься на рівні мазків (з уникненням часового параметра, якщо визначення мазків не залежить від часу). 0,0 — без сповільнення (негайне застосування змін)

source: Elliptical dab: ratio
ta: நீள்வட்ட DAB: விகிதம்
uk: Еліптичний мазок: коефіцієнт стискання

source: Aspect ratio of the dabs; must be >= 1.0, where 1.0 means a perfectly round dab.
ta: DAB களின் விகித விகிதம்; > = 1.0 ஆக இருக்க வேண்டும், அங்கு 1.0 என்பது ஒரு முழுமையான வட்டமான டப் என்று பொருள்.
uk: Співвідношення сторін мазків; значення >= 1,0, де 1,0 відповідає круговому мазку.

source: Elliptical dab: angle
ta: நீள்வட்ட DAB: கோணம்
uk: Еліптичний мазок: кут

source: Angle by which elliptical dabs are tilted 0.0 horizontal dabs 45.0 45 degrees, turned clockwise 180.0 horizontal again
ta: நீள்வட்ட டப்கள் சாய்ந்த கோணம் 0.0 கிடைமட்ட DAB கள் 45.0 45 டிகிரி, கடிகார திசையில் திரும்பியது 180.0 மீண்டும் கிடைமட்டமாக
uk: Визначає нахил великої півосі еліптичних мазків 0,0 — горизонтальні мазки 45,0 — мазки, нахилені на 45 градусів за годинниковою стрілкою 180,0 — знову горизонтальні мазки

source: Direction filter
ta: திசை வடிகட்டி
uk: Фільтр напрямку

source: A low value will make the direction input adapt more quickly, a high value will make it smoother
ta: குறைந்த மதிப்பு திசை உள்ளீட்டை விரைவாக மாற்றியமைக்கும், அதிக மதிப்பு அதை மென்மையாக்கும்
uk: Низьке значення цього параметра призводитиме до швидшого встановлення відповідності за вхідними даними напрямку; вище значення надасть вам змогу малювати плавніші лінії

source: Lock alpha
ta: பூட்டு ஆல்பா
uk: Заблокувати альфа-канал (непрозорості)

source: Do not modify the alpha channel of the layer (paint only where there is paint already) 0.0 normal painting 0.5 half of the paint gets applied normally 1.0 alpha channel fully locked
ta: அடுக்கின் ஆல்பா சேனலை மாற்ற வேண்டாம் (ஏற்கனவே வண்ணப்பூச்சு இருக்கும் இடத்தில் மட்டுமே வண்ணம் தீட்டவும்) 0.0 சாதாரண ஓவியம் வண்ணப்பூச்சின் 0.5 பாதி பொதுவாக பயன்படுத்தப்படுகிறது 1.0 ஆல்பா சேனல் முழுமையாக பூட்டப்பட்டுள்ளது
uk: Не змінювати альфа-канал шару (малювати лише там де вже намальовано) 0.0 нормальне малювання 0.5 правило буде застосовано до половини фарби 1.0 альфа-канал повністю заблоковано

source: Colorize
ta: வண்ணமயமாக்கல்
uk: Розфарбувати

source: Colorize the target layer, setting its hue and saturation from the active brush color while retaining its value and alpha.
ta: இலக்கு அடுக்கை வண்ணமயமாக்குங்கள், அதன் சாயல் மற்றும் செறிவூட்டலை செயலில் உள்ள தூரிகை நிறத்திலிருந்து அதன் மதிப்பு மற்றும் ஆல்பாவைத் தக்க வைத்துக் கொள்ளுங்கள்.
uk: Розфарбувати потрібний шар, встановивши його відтінок і насиченість від активного пензля, зберігаючи його значення кольору та альфа-канал.

source: Posterize
ta: சுவரொட்டி
uk: Постеризація

source: Strength of posterization, reducing number of colors based on the "Posterization levels" setting, while retaining alpha.
ta: போச்டரைசேசனின் வலிமை, "போச்டரைசேசன் நிலைகள்" அமைப்பின் அடிப்படையில் வண்ணங்களின் எண்ணிக்கையைக் குறைத்தல், ஆல்பாவைத் தக்க வைத்துக் கொள்ளும்போது.
uk: Сила постеризації, зменшення кількості кольорів на основі параметра "Рівні постеризації" під час збереження альфа-каналу.

source: Posterization levels
ta: சுவரொட்டி நிலைகள்
uk: Рівні постеризації

source: Number of posterization levels (divided by 100). 0.05 = 5 levels, 0.2 = 20 levels, etc. Values above 0.5 may not be noticeable.
ta: சுவரொட்டி நிலைகளின் எண்ணிக்கை (100 ஆல் வகுக்கப்படுகிறது). 0.05 = 5 நிலைகள், 0.2 = 20 நிலைகள், முதலியன. 0.5 க்கு மேலே உள்ள மதிப்புகள் கவனிக்கப்படாமல் இருக்கலாம்.
uk: Кількість рівнів постеризації (поділена на 100). 0.05 = 5 рівнів, 0.2 = 20 рівнів і т.д. За встановлення значень понад 0.5 ефект може бути не помітний оку.

source: Snap to pixel
ta: பிக்சலுக்கு ச்னாப்
uk: Прив'язати до пікселя

source: Snap brush dab's center and its radius to pixels. Set this to 1.0 for a thin pixel brush.
ta: ச்னாப் தூரிகை டாபின் நடுவண் மற்றும் அதன் ஆரம் பிக்சல்களுக்கு. மெல்லிய படப்புள்ளி தூரிகைக்கு இதை 1.0 ஆக அமைக்கவும்.
uk: Прив’язати центр мазків пензля і радіус до пікселя. Установіть значення 1.0 для тонкого піксельного пензля.

source: Pressure gain
ta: அழுத்தம் ஆதாயம்
uk: Підсилення тиску

source: This changes how hard you have to press. It multiplies tablet pressure by a constant factor.
ta: இது நீங்கள் எவ்வளவு கடினமாக அழுத்த வேண்டும் என்பதை மாற்றுகிறது. இது ஒரு நிலையான காரணியால் டேப்லெட் அழுத்தத்தை பெருக்குகிறது.
uk: Визначає, наскільки сильно треба тиснути. Примножує значення тиску планшету постійним множником.

source: Pressure
ta: அழுத்தம்
uk: Тиск

source: The pressure reported by the tablet. Usually between 0.0 and 1.0, but it may get larger when a pressure gain is used. If you use the mouse, it will be 0.5 when a button is pressed and 0.0 otherwise.
ta: டேப்லெட்டால் அறிவிக்கப்பட்ட அழுத்தம். வழக்கமாக 0.0 முதல் 1.0 வரை, ஆனால் அழுத்தம் அதிகரிப்பு பயன்படுத்தப்படும்போது அது பெரிதாகலாம். நீங்கள் சுட்டியைப் பயன்படுத்தினால், ஒரு பொத்தானை அழுத்தும்போது அது 0.5 ஆகவும், இல்லையெனில் 0.0 ஆகவும் இருக்கும்.
uk: Значення натиску, отримане від планшета, від 0,0 до 1,0. Якщо ви використовуєте мишу, значенням буде 0,5, якщо натиснуто кнопку, і 0,0, якщо кнопку не натиснуто.

source: Random
ta: குறிப்பிலாத
uk: Випадковий

source: Fast random noise, changing at each evaluation. Evenly distributed between 0 and 1.
ta: வேகமான சீரற்ற ஒலி, ஒவ்வொரு மதிப்பீட்டிலும் மாறுகிறது. 0 மற்றும் 1 க்கு இடையில் சமமாக விநியோகிக்கப்படுகிறது.
uk: Швидкозмінний випадковий шум, змінюється під час кожного обчислення. Рівномірно розподілено від 0 до 1.

source: Stroke
ta: பக்கவாதம்
uk: Штрих

source: This input slowly goes from zero to one while you draw a stroke. It can also be configured to jump back to zero periodically while you move. Look at the 'stroke duration' and 'stroke hold time' settings.
ta: இந்த உள்ளீடு மெதுவாக பூச்சியத்திலிருந்து ஒன்றுக்குச் செல்லும் போது நீங்கள் ஒரு பக்கவாதம் வரையும். நீங்கள் நகரும்போது அவ்வப்போது பூச்சியத்திற்குத் திரும்பிச் செல்லவும் இது கட்டமைக்கப்படலாம். 'பக்கவாதம் காலம்' மற்றும் 'ச்ட்ரோக் ஓல்ட் டைம்' அமைப்புகளைப் பாருங்கள்.
uk: Ці вхідні дані повільно змінюються від нуля до одиниці під час малювання штриха. Програму можна налаштувати так, щоб значення періодично поверталося до нуля під час малювання штриха. Див. параметри «тривалість штриха» та «час утримування штриха».

source: Direction
ta: திசை
uk: Напрямок

source: The angle of the stroke, in degrees. The value will stay between 0.0 and 180.0, effectively ignoring turns of 180 degrees.
ta: பக்கவாதத்தின் கோணம், டிகிரிகளில். மதிப்பு 0.0 முதல் 180.0 வரை இருக்கும், இது 180 டிகிரி திருப்பங்களை திறம்பட புறக்கணிக்கும்.
uk: Кут штриха у градусах. Значення від 0,0 до 180,0, повороти на 180 градусів не змінюватимуть значення кута.

source: Declination/Tilt
ta: வீழ்ச்சி/சாய்வு
uk: Схилення/нахил

source: Declination of stylus tilt. 0 when stylus is parallel to tablet and 90.0 when it's perpendicular to tablet.
ta: ச்டைலச் சாய்வின் வீழ்ச்சி. ச்டைலச் டேப்லெட்டுக்கு இணையாக இருக்கும்போது மற்றும் டேப்லெட்டுக்கு செங்குத்தாக இருக்கும்போது 90.0.
uk: Нахил стилуса до поверхні планшету. 0 коли стилус лежить на планшеті і 90.0 коли він перпендикулярний планшету.

source: Ascension
ta: அசென்சன்
uk: Напрямок нахилу

source: Right ascension of stylus tilt. 0 when stylus working end points to you, +90 when rotated 90 degrees clockwise, -90 when rotated 90 degrees counterclockwise.
ta: ச்டைலச் சாய்வின் வலது அசென்சன். 0 ச்டைலச் வேலை இறுதி உங்களுக்கு சுட்டிக்காட்டும்போது, 90 டிகிரி கடிகார திசையில் சுழற்றும்போது +90, -90 90 டிகிரி எதிரெதிர் திசையில் சுழற்றும்போது.
uk: Напрямок нахилу стилуса. 0 коли він нахилений робочим кінцем до вас, +90 коли повернутий на 90 градусів за годинниковою стрілкою, -90 градусів- проти годинникової стрілки.

source: Fine speed
ta: நல்ல விரைவு
uk: Точна швидкість

source: How fast you currently move. This can change very quickly. Try 'print input values' from the 'help' menu to get a feeling for the range; negative values are rare but possible for very low speed.
ta: நீங்கள் தற்போது எவ்வளவு வேகமாக நகர்கிறீர்கள். இது மிக விரைவாக மாறக்கூடும். வரம்பிற்கு ஒரு உணர்வைப் பெற 'உதவி' மெனுவிலிருந்து 'உள்ளீட்டு மதிப்புகளை அச்சிடு' முயற்சிக்கவும்; எதிர்மறை மதிப்புகள் அரிதானவை, ஆனால் மிகக் குறைந்த வேகத்திற்கு சாத்தியம்.
uk: Поточна швидкість руху. Це значення дуже швидко змінюється. Позначте пункт «Виводити вхідні значення» у меню «Довідка», щоб оцінити діапазон можливих значень; поява від'ємних значень є рідкісною, але можливою за дуже малої швидкості.

source: Gross speed
ta: மொத்த விரைவு
uk: Основна швидкість

source: Same as fine speed, but changes slower. Also look at the 'gross speed filter' setting.
ta: சிறந்த வேகத்தைப் போலவே, ஆனால் மெதுவாக மாறுகிறது. 'மொத்த வேக வடிகட்டி' அமைப்பையும் பாருங்கள்.
uk: Те саме, що і точна швидкість, але з повільнішою зміною. Див. також параметр «фільтр основної швидкості».

source: Custom
ta: தனிபயன்
uk: Нетиповий

source: This is a user defined input. Look at the 'custom input' setting for details.
ta: இது பயனர் வரையறுக்கப்பட்ட உள்ளீடு. விவரங்களுக்கு 'தனிப்பயன் உள்ளீடு' அமைப்பைப் பாருங்கள்.
uk: Це визначені користувачем параметри вхідних даних. Докладніше про них у підказці до параметра «нетипові вхідні дані».

source: Direction 360
ta: திசை 360
uk: Напрямок 360

source: The angle of the stroke, from 0 to 360 degrees.
ta: பக்கவாதத்தின் கோணம், 0 முதல் 360 டிகிரி வரை.
uk: Кут штриха, від 0 до 360 градусів.

source: Attack Angle
ta: தாக்குதல் கோணம்
uk: Кут атаки

source: The difference, in degrees, between the angle the stylus is pointing and the angle of the stroke movement. The range is +/-180.0. 0.0 means the stroke angle corresponds to the angle of the stylus. 90 means the stroke angle is perpendicular to the angle of the stylus. 180 means the angle of the stroke is directly opposite the angle of the stylus.
ta: வேறுபாடு, டிகிரிகளில், ச்டைலச் சுட்டிக்காட்டும் கோணத்திற்கும் பக்கவாதம் இயக்கத்தின் கோணத்திற்கும் இடையில். வரம்பு +/- 180.0. 0.0 என்றால் பக்கவாதம் கோணம் ச்டைலசின் கோணத்திற்கு ஒத்திருக்கிறது. 90 என்றால் பக்கவாதம் கோணம் ச்டைலசின் கோணத்திற்கு செங்குத்தாக உள்ளது. 180 என்றால் பக்கவாதத்தின் கோணம் நேரடியாக ச்டைலசின் கோணத்திற்கு எதிரே உள்ளது.
uk: Різниця (у градусах) між кутом, під яким вказує перо, і кутом руху штриха. Діапазон: +/- 180.0. 0.0 - кут штриха відповідає куту пера. 90 - кут штриха перпендикулярний куту пера. 180 - кут штриха прямо протилежний куту пера.

source: Declination/Tilt X
ta: வீழ்ச்சி/சாய்வு ஃச்
uk: Схилення/Нахил X

source: Declination of stylus tilt on X-Axis. 90/-90 when stylus is parallel to tablet and 0 when it's perpendicular to tablet.
ta: எக்ச்-அச்சில் ச்டைலச் சாய்வின் வீழ்ச்சி. 90/-90 ச்டைலச் டேப்லெட்டுக்கு இணையாக இருக்கும்போது மற்றும் டேப்லெட்டுக்கு செங்குத்தாக இருக்கும்போது 0.
uk: Нахил стилуса до осі Х. 90/-90 коли стилус лежить на планшеті й 0 коли він перпендикулярний планшету.

source: Declination/Tilt Y
ta: வீழ்ச்சி/சாய்வு ஒய்
uk: Схилення/Нахил Y

source: Declination of stylus tilt on Y-Axis. 90/-90 when stylus is parallel to tablet and 0 when it's perpendicular to tablet.
ta: Y- அச்சில் ச்டைலச் சாய்வின் வீழ்ச்சி. 90/-90 ச்டைலச் டேப்லெட்டுக்கு இணையாக இருக்கும்போது மற்றும் டேப்லெட்டுக்கு செங்குத்தாக இருக்கும்போது 0.
uk: Нахил стилуса по осі Y. 90/-90 коли стилус лежить на планшеті й 0, коли він перпендикулярний планшету.

source: GridMap X
ta: கிரிட்மேப் ஃச்
uk: Сітка X

source: The X coordinate on a 256 pixel grid. This will wrap around 0-256 as the cursor is moved on the X axis. Similar to "Stroke". Can be used to add paper texture by modifying opacity, etc. The brush size should be considerably smaller than the grid scale for best results.
ta: ஃச் 256 படப்புள்ளி கட்டத்தில் ஒருங்கிணைக்கிறது. கர்சர் ஃச் அச்சில் நகர்த்தப்படுவதால் இது 0-256 சுற்றி வரும். "பக்கவாதம்" போன்றது. ஒளிபுகாநிலையை மாற்றுவதன் மூலம் காகித அமைப்பைச் சேர்க்க பயன்படுத்தலாம். சிறந்த முடிவுகளுக்கான கட்டம் அளவை விட தூரிகை அளவு கணிசமாக சிறியதாக இருக்க வேண்டும்.
uk: Координата X у 256-піксельній сітці. Переміщується в діапазоні 0-256 у міру переміщення вказівника за віссю X. Аналогічно параметру "Штрих". Можна використовувати для додавання текстури паперу шляхом зміни непрозорості тощо. Для отримання найкращого результату розмір пензля повинен бути значно менше масштабу сітки.

source: GridMap Y
ta: கிரிட்மேப் ஒய்
uk: Сітка Y

source: The Y coordinate on a 256 pixel grid. This will wrap around 0-256 as the cursor is moved on the Y axis. Similar to "Stroke". Can be used to add paper texture by modifying opacity, etc. The brush size should be considerably smaller than the grid scale for best results.
ta: ஒய் 256 படப்புள்ளி கட்டத்தில் ஒருங்கிணைக்கிறது. கர்சர் ஒய் அச்சில் நகர்த்தப்படுவதால் இது 0-256 சுற்றி வரும். "பக்கவாதம்" போன்றது. ஒளிபுகாநிலையை மாற்றுவதன் மூலம் காகித அமைப்பைச் சேர்க்க பயன்படுத்தலாம். சிறந்த முடிவுகளுக்கான கட்டம் அளவை விட தூரிகை அளவு கணிசமாக சிறியதாக இருக்க வேண்டும்.
uk: Координата Y у 256-піксельній сітці. Переміщується в діапазоні 0-256 у міру переміщення вказівника за віссю Y. Аналогічно параметру "Штрих". Можна використовувати для додавання текстури паперу шляхом зміни непрозорості тощо. Для отримання найкращого результату розмір пензля повинен бути значно менше масштабу сітки.

source: Zoom Level
ta: சூம் நிலை
uk: Масштаб

source: The current zoom level of the canvas view. Logarithmic: 0.0 is 100%, 0.69 is 200%, -1.38 is 25% For the Radius setting, using a value of -4.15 makes the brush size roughly constant, relative to the level of zoom.
ta: கேன்வாச் பார்வையின் தற்போதைய சூம் நிலை. மடக்கை: 0.0 100%, 0.69 200%, -1.38 25%ஆகும் ஆரம் அமைப்பைப் பொறுத்தவரை, -4.15 மதிப்பைப் பயன்படுத்துவது தூரிகை அளவை தோராயமாக மாறாமல், சூம் அளவோடு ஒப்பிடும்போது.
uk: Поточний масштаб показу полотна. Логаритмічний: 0.0 - 100%, 0.69 - 200%, -1.38 - 25% Якщо для параметра «Радіус» використовується значення -4.15, розмір пензля буде приблизно постійним щодо масштабу.

source: Base Brush Radius
ta: அடிப்படை தூரிகை ஆரம்
uk: Основний радіус пензля
